{
    "chat": [
        "How's your day going?",
        "Tell me about your hobbies.",
        "What's your favorite movie?",
        "Do you like to travel?",
        "What music do you enjoy listening to?",
        "How do you spend your weekends?",
        "Tell me a joke!",
        "What's your favorite book?",
        "Are you a morning person or a night owl?",
        "What's your opinion on current events?",
        "If you could have any superpower, what would it be?",
        "What's the best place you've ever visited?",
        "Do you have any pets?",
        "What's your favorite food?",
        "What languages do you speak?",
        "What's the most adventurous thing you've done?",
        "Tell me about your dream job.",
        "What's your favorite season?",
        "Describe your perfect day.",
        "What's your favorite TV show?",
        "What's the last movie you watched?",
        "What are you passionate about?",
        "Do you prefer tea or coffee?",
        "If you could time travel, where would you go?",
        "What's the most interesting fact you know?",
        "What's your favorite sport?",
        "What do you do to relax?",
        "What's your favorite quote?",
        "What's your biggest achievement?",
        "What's something you've always wanted to learn?",
        "What's the craziest thing you've ever done?",
        "Tell me about your family.",
        "What's your favorite holiday?",
        "What's your idea of a perfect weekend?",
        "What's your favorite board game?",
        "What's your favorite dessert?",
        "Do you enjoy cooking?",
        "What's the best advice you've ever received?",
        "What's your favorite type of movie?",
        "If you could meet anyone, living or dead, who would it be?",
        "What's your opinion on social media?",
        "What's your favorite childhood memory?",
        "Do you believe in aliens?",
        "What's the most exciting place you've been to?",
        "What's your favorite type of art?",
        "What's your favorite app on your phone?",
        "What's your go-to karaoke song?",
        "What's your favorite thing about yourself?",
        "What's the most interesting place you've been?",
        "What's your favorite way to exercise?",
        "If you could live anywhere, where would it be?",
        "What's the best book you've read recently?",
        "What's your favorite color?",
        "What's your opinion on climate change?",
        "What's the most beautiful place you've seen?",
        "What's your favorite historical period?",
        "What's your favorite thing to do on a rainy day?",
        "What's your dream travel destination?",
        "Do you enjoy outdoor activities?",
        "What's your favorite thing to do in your free time?",
        "What's your favorite quote from a movie?",
        "What's your opinion on artificial intelligence?",
        "What's your favorite subject in school?",
        "What's your favorite way to start the day?",
        "What's the most valuable lesson you've learned?",
        "What's your favorite fashion trend?",
        "Do you have any hidden talents?",
        "What's your favorite form of entertainment?",
        "What's your favorite thing about nature?",
        "What's your favorite animal?",
        "What's your opinion on fast food?",
        "What's your favorite way to travel?",
        "What's your favorite outdoor activity?",
        "What's your favorite thing to do in the evening?",
        "What's your favorite childhood game?",
        "What's your opinion on virtual reality?",
        "What's your favorite thing about technology?",
        "What's the most interesting job you've heard of?",
        "What's your favorite thing about where you live?",
        "What's your opinion on social networking?",
        "What's your favorite thing about your job?",
        "What's your favorite movie genre?",
        "What's your favorite part about holidays?",
        "What's your opinion on self-driving cars?",
        "What's your favorite mode of transportation?",
        "What's your favorite thing about the internet?",
        "What's your favorite type of cuisine?",
        "What's your favorite thing about yourself?",
        "What's your opinion on remote work?",
        "What's your favorite thing about traveling?",
        "What's your favorite childhood toy?",
        "What's your favorite thing about winter?",
        "What's your opinion on online shopping?",
        "What's your favorite thing about summer?",
        "What's your favorite thing about autumn?",
        "What's your opinion on renewable energy?",
        "What's your favorite thing about spring?",
        "What's your favorite thing about your hometown?",
        "What's your opinion on gaming?",
        "What's your favorite thing about your favorite hobby?",
        "What's your favorite thing about your favorite food?",
        "What's your opinion on e-books vs. physical books?",
        "What's your favorite thing about learning new things?",
        "What's your favorite thing about your favorite TV show?",
        "What's your opinion on space exploration?",
        "What's your favorite thing about your favorite movie?",
        "What's your opinion on time travel?",
        "What's your favorite thing about your favorite book?",
        "What's your favorite thing about your favorite sport?",
        "What's your opinion on music streaming services?",
        "What's your favorite thing about your favorite song?",
        "What's your opinion on privacy in the digital age?",
        "What's your favorite thing about your favorite artist?",
        "What's your favorite thing about your favorite game?",
        "What's your opinion on online privacy?",
        "What's your favorite thing about your favorite place?",
        "What's your favorite thing about your favorite holiday?",
        "What's your opinion on augmented reality?",
        "What's your favorite thing about your favorite app?",
        "What's your favorite thing about your favorite social media platform?",
        "What's your opinion on wearable technology?",
        "What's your favorite thing about your favorite gadget?",
        "What's your favorite thing about your favorite device?",
        "What's your opinion on artificial intelligence in daily life?",
        "What's your favorite thing about your favorite AI technology?",
        "What's your favorite thing about your favorite website?",
        "What's your opinion on ethical implications of AI?",
        "What's your favorite thing about your favorite programming language?",
        "What's your favorite thing about your favorite coding project?",
        "What's your opinion on the future of technology?",
        "What's your favorite thing about your favorite tech company?",
        "What's your favorite thing about your favorite tech innovation?",
        "What's your opinion on technology's impact on society?",
        "What's your favorite thing about your favorite technological advancement?",
        "What's your favorite thing about your favorite software?",
        "What's your opinion on the role of technology in education?",
        "What's your favorite thing about your favorite software tool?"
      ],
    "coding assistant": [
        "How do I declare a variable in Python?",
        "Can you help me with debugging this code?",
        "Explain object-oriented programming concepts.",
        "What's the difference between '==' and 'is' in Python?",
        "How can I handle exceptions in Python?",
        "What are Python decorators and how do they work?",
        "How do I create a class in Python?",
        "Explain the concept of inheritance in programming.",
        "What are lambda functions in Python?",
        "How can I work with files in Python?",
        "What is a virtual environment in Python?",
        "Explain the difference between 'append()' and 'extend()' in Python lists.",
        "How do I use list comprehensions in Python?",
        "What is recursion and when should I use it?",
        "How do I install and use external libraries in Python?",
        "What are Python generators and how do they work?",
        "Explain the concept of scope in Python.",
        "How do I perform web scraping in Python?",
        "What are the best practices for writing clean code in Python?",
        "How can I use regular expressions in Python?",
        "Explain the difference between 'global' and 'local' variables in Python.",
        "How do I handle time and dates in Python?",
        "What is the purpose of the 'self' keyword in Python?",
        "How do I work with JSON data in Python?",
        "Explain the concept of polymorphism in object-oriented programming.",
        "What are the advantages of using Python for data analysis?",
        "How do I implement error handling in Python?",
        "What are Python packages and modules?",
        "How can I use APIs in Python?",
        "Explain the concept of 'args' and 'kwargs' in Python functions.",
        "How do I create a GUI in Python?",
        "What are the differences between Python 2 and Python 3?",
        "How do I perform unit testing in Python?",
        "What are the benefits of using Python for machine learning?",
        "Explain the purpose of 'pip' in Python.",
        "How do I sort data in Python?",
        "What are the different data types available in Python?",
        "How do I work with databases in Python?",
        "Explain the concept of 'map()', 'filter()', and 'reduce()' in Python.",
        "What are context managers in Python?",
        "How do I use decorators for memoization in Python?",
        "What is the purpose of '__init__' in Python classes?",
        "How can I handle concurrency in Python?",
        "Explain the concept of 'try', 'except', 'else', and 'finally' blocks in Python.",
        "How do I perform data visualization in Python?",
        "What are the principles of functional programming in Python?",
        "How do I optimize code performance in Python?",
        "What are the best practices for handling memory management in Python?",
        "Explain the use of 'super()' in Python classes.",
        "How do I create a virtual environment in Python?",
        "What is the purpose of 'numpy' in Python?",
        "How do I work with multi-dimensional arrays in Python?",
        "Explain the concept of 'recursion limit' in Python.",
        "How can I use Python for natural language processing?",
        "What are the differences between '==', 'is', and 'is not' operators in Python?",
        "How do I use 'asyncio' for asynchronous programming in Python?",
        "Explain the purpose of 'pickle' in Python.",
        "How do I perform file I/O operations in Python?",
        "What is the purpose of 'docstrings' in Python?",
        "How can I handle multi-threading in Python?",
        "Explain the concept of 'thread safety' in Python.",
        "What are the benefits of using 'pandas' in Python for data manipulation?",
        "How do I work with XML and HTML parsing in Python?",
        "What are the differences between 'class' and 'instance' variables in Python?",
        "How do I use 'requests' to make HTTP requests in Python?",
        "Explain the purpose of 'logging' in Python.",
        "How can I implement a neural network using Python libraries?",
        "What are the differences between 'shallow copy' and 'deep copy' in Python?",
        "How do I use 'matplotlib' for data visualization in Python?",
        "What is the purpose of 'sys' module in Python?",
        "Explain the use of 'itertools' module in Python.",
        "How do I work with regular expressions in Python?",
        "What are the differences between 'classmethod' and 'staticmethod' in Python?",
        "How can I handle exceptions and errors in Python gracefully?",
        "Explain the purpose of 'beautifulsoup' in Python web scraping.",
        "How do I implement a recommendation system in Python?",
        "What are the benefits of using Python for web development?",
        "How do I handle binary data in Python?",
        "What are the differences between 'len()' and '__len__()' in Python?",
        "Explain the concept of 'context managers' in Python.",
        "How do I use 're' module for regular expressions in Python?",
        "What is the purpose of 'async' and 'await' in Python?",
        "How can I build a chatbot using Python?",
        "Explain the concept of 'pipenv' and 'virtualenv' in Python.",
        "How do I work with big data using Python?",
        "What are the differences between 'while' and 'for' loops in Python?",
        "How can I use 'scikit-learn' for machine learning in Python?",
        "Explain the concept of 'annotations' in Python functions.",
        "How do I handle Unicode and encoding in Python?",
        "What are the differences between 'assert' and 'raise' in Python?",
        "How can I use Python for sentiment analysis?",
        "Explain the purpose of 'unittest' module in Python.",
        "How do I use 'yaml' for data serialization in Python?",
        "What are the differences between 'sorted()' and 'sort()' in Python?",
        "How can I implement a recommendation system using collaborative filtering in Python?",
        "Explain the concept of 'monkey patching' in Python.",
        "How do I use 'PyQt' for building GUI applications in Python?",
        "What are the differences between 'copy()' and 'deepcopy()' in Python?",
        "How can I perform web scraping using 'Selenium' in Python?",
        "Explain the concept of 'threading' in Python.",
        "How do I use 'flask' for building web applications in Python?",
        "What are the differences between 'append()' and 'insert()' in Python lists?",
        "How can I implement a decision tree using 'scikit-learn' in Python?",
        "Explain the purpose of 'struct' module in Python.",
        "How do I handle NaN values in pandas DataFrame?",
        "What are the differences between 'pop()' and 'remove()' in Python lists?",
        "How can I use Python for image processing?",
        "Explain the concept of 'metaclasses' in Python."
    ],
    "secretary": [
        "Schedule a meeting for tomorrow at 10 AM.",
        "Please remind me to call John at 3 PM.",
        "Find flights to London for next week.",
        "Set an appointment with the doctor on Friday at 2 PM.",
        "Remind me to buy groceries after work today.",
        "Book a restaurant reservation for two at 7 PM on Saturday.",
        "Create a to-do list for the upcoming week.",
        "Set an alarm for 8 AM every weekday.",
        "Schedule a follow-up meeting with the team for next Monday.",
        "Remind me to water the plants every other day.",
        "Find a rental car for the weekend trip to the countryside.",
        "Book tickets for the theater play next month.",
        "Set up a reminder for the project deadline next week.",
        "Schedule a video call with the client for this Thursday.",
        "Remind me to take medicine at noon.",
        "Find a suitable hotel for the upcoming business trip.",
        "Set a reminder for the anniversary dinner next Saturday.",
        "Schedule a pickup for the laundry service on Wednesday.",
        "Remind me to submit the report by the end of the day.",
        "Book tickets for the concert in the city next weekend.",
        "Set a reminder to check the mailbox every morning.",
        "Schedule a doctor's appointment for a check-up.",
        "Remind me to send the important email at 2 PM.",
        "Find the nearest coffee shop for a meeting tomorrow morning.",
        "Set an alarm for the early morning workout session.",
        "Schedule a session for house cleaning next Sunday.",
        "Remind me to pay the utility bills before the due date.",
        "Book a table at the fancy restaurant for a special occasion.",
        "Set a reminder for the weekly team meeting.",
        "Schedule a dentist appointment for next month.",
        "Remind me to call the insurance company this afternoon.",
        "Find a good gift idea for a friend's birthday.",
        "Book a ticket for the train journey next weekend.",
        "Set a reminder for the parent-teacher meeting at school.",
        "Schedule a haircut appointment for next week.",
        "Remind me to update the project status report on Monday.",
        "Find a suitable venue for the upcoming event.",
        "Set up a reminder to buy tickets for the movie premiere.",
        "Schedule a session for home repairs this Saturday.",
        "Remind me to pick up dry cleaning on Thursday.",
        "Book a reservation for a spa day on the weekend.",
        "Set a reminder for the weekly grocery shopping.",
        "Find a place for the upcoming family gathering.",
        "Schedule a check-up appointment for the car next week.",
        "Remind me to submit the travel expense report on time.",
        "Book tickets for the weekend getaway.",
        "Set a reminder for the deadline of the project proposal.",
        "Schedule a meeting with the financial advisor next month."
    ],
    "terminal": [
        "List all files in the current directory.",
        "How do I move a file in the terminal?",
        "Show me the contents of a text file.",
        "Create a new directory in the terminal.",
        "How can I copy files and directories using the terminal?",
        "Display the permissions of a file in the terminal.",
        "How do I delete a file using the terminal?",
        "Navigate to a specific directory in the terminal.",
        "How can I search for a specific text pattern in files?",
        "Change the file permissions in the terminal.",
        "How do I rename a file or directory in the terminal?",
        "Execute a command with elevated privileges in the terminal.",
        "Display disk usage in the terminal.",
        "How can I create a symbolic link in the terminal?",
        "Extract files from an archive using the terminal.",
        "How do I find and replace text in a file using the terminal?",
        "Check the system information in the terminal.",
        "How to view the history of commands in the terminal?",
        "Install a package using the terminal package manager.",
        "Run a script or executable file in the terminal.",
        "How can I compress files and directories in the terminal?",
        "Show the process list in the terminal.",
        "How to edit a file using terminal-based text editors?",
        "Find a specific file or directory in the system using the terminal.",
        "How do I check network connectivity in the terminal?",
        "Print the working directory path in the terminal.",
        "How can I view system logs in the terminal?",
        "How to kill a process in the terminal?",
        "Execute commands on multiple files or directories in the terminal.",
        "How do I check system resource usage in the terminal?",
        "Retrieve detailed information about a file in the terminal.",
        "Display system and kernel information in the terminal.",
        "How can I monitor file changes in real-time using the terminal?",
        "Compare files or directories in the terminal.",
        "How to set environment variables in the terminal?",
        "View and manage users and groups in the terminal.",
        "How do I edit permissions for users or groups in the terminal?",
        "How to archive files using different compression formats in the terminal?",
        "Check and modify system services in the terminal.",
        "How can I run commands in the background in the terminal?",
        "Configure network settings using the terminal.",
        "How to generate a secure hash of a file in the terminal?",
        "Execute commands at regular intervals in the terminal.",
        "How do I manage installed software and repositories in the terminal?",
        "Monitor system performance and resource usage in the terminal.",
        "How to encrypt and decrypt files using the terminal?",
        "Find and kill processes by name in the terminal.",
        "Perform basic mathematical operations in the terminal.",
        "How can I view and manage partitions and disk drives in the terminal?",
        "Display and modify environment variables in the terminal.",
        "How to remove empty directories in the terminal?",
        "Search for files based on size and date in the terminal.",
        "Execute multiple commands sequentially in the terminal.",
        "How do I monitor network activity in the terminal?",
        "View and manage installed printers in the terminal.",
        "How to display calendar and date information in the terminal?",
        "Perform file system checks and repairs in the terminal.",
        "View and modify system startup services in the terminal.",
        "How do I list open ports in the terminal?",
        "Display and manage kernel modules in the terminal.",
        "How to generate random data or passwords in the terminal?",
        "Print specific lines or segments of a file in the terminal.",
        "Search for text within files recursively in the terminal.",
        "How do I check system hardware information in the terminal?",
        "View and manage system logs and log files in the terminal."
    ]
  }
  